In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
df.shape

(891, 15)

In [8]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
df.columns.values

array(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'], dtype=object)

# categorical columns 
# sex
# class who
# adult_male
# deck
# class
# embarked
# embark_town
# alone


# Numerical Columns
# age
# survived
# pclass
# age
# sibsp
# parch
# fare

In [10]:
# missing values in age , embark , deck , embark_town
# more than 70% values are missing in deck column
# few columns have inappropraite data type

In [11]:
df.drop(columns=['deck'],inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(6)
memory usage: 85.4+ KB

In [13]:
# imputing missing values for age
df['age'].fillna(df['age'].mean() , inplace = True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(6)
memory usage: 85.4+ KB

In [15]:
# handling missing values for embarked
df['embarked'].fillna('S' , inplace = True)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(6)
memory usage: 85.4+ KB

In [17]:
# handling missing values for embark_town
df['embark_town'].fillna('Southampton' , inplace = True)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  891 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(6)
memory usage: 85.4+ KB

In [19]:
df['parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: parch, dtype: int64

In [20]:
df['sibsp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64

In [21]:
# changing datatype of the following columns
# 
df['age'] = df['age'].astype(int)
df['sex'] = df['sex'].astype('category')

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    category
 3   age          891 non-null    int32
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  891 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(1), int32(1), int64(4), object(5)
memory usage: 75.9+ KB

In [23]:
# there are certain columns that are repeating
# survived and alive hence remove the alive column
# embark and embark_town are same 
df.drop(columns=['embark_town'],inplace=True)
df.drop(columns=['class'],inplace=True)

In [24]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,alive,alone
0,0,3,male,22,1,0,7.2500,S,man,True,no,False
1,1,1,female,38,1,0,71.2833,C,woman,False,yes,False
2,1,3,female,26,0,0,7.9250,S,woman,False,yes,True
3,1,1,female,35,1,0,53.1000,S,woman,False,yes,False
4,0,3,male,35,0,0,8.0500,S,man,True,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,man,True,no,True
887,1,1,female,19,0,0,30.0000,S,woman,False,yes,True
888,0,3,female,29,1,2,23.4500,S,woman,False,no,False
889,1,1,male,26,0,0,30.0000,C,man,True,yes,True
890,0,3,male,32,0,0,7.7500,Q,man,True,no,True

In [25]:
df.drop(columns=['who'],inplace=True)

In [26]:
df.drop(columns=['alone'],inplace=True)

In [27]:
df.drop(columns=['class'],inplace=True)

KeyError: "['class'] not found in axis"

In [ ]:
df.drop(columns=['adult_male'],inplace=True)

In [ ]:
df.info()

In [ ]:
df['survived'] = df['survived'].astype('category')
df['pclass'] = df['pclass'].astype('category')
df['embarked'] = df['embarked'].astype('category')

In [ ]:
df.info()

In [ ]:
df

In [ ]:
# now that we have removed unwanted and duplicate columns from the data 
# now our file size of titanic data set has reduced to 28mb 
# decreased about 1/3 
df.describe()

In [ ]:
# univariate analysis
sns.countplot(df['survived'])

In [ ]:
sns.countplot(df['pclass'])

In [ ]:
sns.countplot(df['sex'])

In [ ]:
sns.histplot(df['age'])

In [ ]:
sns.countplot(df['sibsp'])

In [ ]:
sns.countplot(df['parch'])

In [ ]:
sns.histplot(df['fare'])

In [ ]:
sns.countplot(df['embarked'])

In [ ]:
sns.distplot(df['age'])
print(df['age'].skew())
print(df['age'].kurt())

In [ ]:
sns.boxplot(df.age)

In [ ]:
print("people with age in between 60 and 70 are " , df[(df['age']>60)&(df['age']<70)].shape[0])
print("people with age in between 70 and 75 are " , df[(df['age']>=70)&(df['age']<=75)].shape[0])
print("people with age in above 75 are " , df[df['age']>75].shape[0] )
print('_'*50)
print("people with age in between 0 and 1 are " , df[df['age']<1].shape[0] )

In [ ]:
sns.distplot(df['fare'])

In [ ]:
df['fare'].skew()

In [ ]:
df['fare'].kurt()

In [ ]:
sns.boxplot(df.fare)

In [ ]:
# fare column is highly left skewed data 
# hence this column might contain outliers

In [ ]:
# multivariate analysis

In [ ]:
sns.countplot(df.survived , hue = df.pclass)

In [ ]:
sns.countplot(df.survived, hue = df.sex)

In [ ]:
sns.countplot(df.survived , hue = df.embarked)

In [ ]:
sns.distplot(df[df['survived']==0]['age'])
sns.distplot(df[df['survived']==1]['age'])

In [ ]:
sns.distplot(df[df['survived']==0]['fare'])
sns.distplot(df[df['survived']==1]['fare'])

In [ ]:
sns.pairplot(df)

In [ ]:
sns.heatmap(df.corr())

In [ ]:
df['family_size'] = df['parch'] + df['sibsp']

In [ ]:
df

In [ ]:
def family_type(number) :
    if number == 0 :
        return 'alone' 
    elif number>0 and number<=4 :
        return 'medium'
    else:
        return 'large'

In [ ]:
df['family_type'] = df['family_size'] . apply(family_type)

In [ ]:
df

In [ ]:
df

In [ ]:
sns.countplot(df.survived , hue = df.family_type)

In [ ]:
# handling outliers in age column 
df = df[df['age']<(df['age'].mean()*3*df['age'].std())]

In [ ]:
df.shape

In [ ]:
# handling outliers in fare column
q1 = np.percentile(df['fare'],25)
q3 = np.percentile(df['fare'],75)

outlier_low =  q1 - 1.5*(q3-q1)
outlier_high =  q3 + 1.5*(q3-q1)

df = df[(df['fare']>outlier_low) & (df['fare']<outlier_high)]

In [ ]:
df.shape

In [ ]:
#one hot encoding

# columns to be transformed are pclass , sex , embarked , family_type
df = pd.get_dummies(data=df , columns=['pclass' ,'sex' ,'embarked' ,'family_type'],drop_first=True)

In [ ]:
sns.heatmap(df.corr() , cmap  = 'summer')

In [ ]:
df

In [ ]:
# conclusion drawn 
# 1. chance of a female surviving the accident is higher than the male
# 2. pclass3 is dangerours becuase there are more dead people in this class
# 3. people embarked at C survived more
# 4 people travelling with medium family size had higher chance of survival than alone and larger family size

In [ ]:
#train_test_split
from sklearn.model_selection import train_test_split

In [ ]:
X = df.drop("survived", axis=1) 
y = df["survived"]                

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [ ]:
X_train

In [ ]:
y_train

In [ ]:
X_test

In [ ]:
y_test